In [27]:
import pymongo
import xml.etree.ElementTree as ET
import pandas as pd
from sqlalchemy import create_engine

In [28]:
client = pymongo.MongoClient('192.168.56.30', 27017)
db = client.climate
collection = db.co2_emissions_collection

# Read XML as binary data
with open('co2_emissions.xml', 'rb') as xml_file:
    xml_data = xml_file.read()

# Insert into MongoDB
document = {'co2_data': xml_data}
collection.insert_one(document)

InsertOneResult(ObjectId('65733cd3baca70a21e59b773'), acknowledged=True)

In [29]:
document = collection.find_one()
xml_data = document['co2_data']
# Parse and create element tree 
root = ET.fromstring(xml_data)

In [30]:
record_elements = root.findall('.//record')
# Find first 'record' element or assign none if nothing found
first_record = record_elements[0] if record_elements else None


# Extract unique column names from the first record 'field' element
headings = [field.attrib['name'] for field in first_record.findall('.//field')] if first_record else []

data = []

# For loop to iterate through each 'record' element and extract the data from 'field'
for record in record_elements:
    #Extract text from 'field' and create row of data
    row_data = [field.text for field in record.findall('.//field')]
    data.append(row_data)

co2_df = pd.DataFrame(data, columns=headings)
co2_df

,Country or Area,Item,Year,Value
0,Aruba,CO2 emissions (metric tons per capita),1960,None
1,Aruba,CO2 emissions (metric tons per capita),1961,None
2,Aruba,CO2 emissions (metric tons per capita),1962,None
3,Aruba,CO2 emissions (metric tons per capita),1963,None
4,Aruba,CO2 emissions (metric tons per capita),1964,None
...,...,...,...,...
16753,Zimbabwe,CO2 emissions (metric tons per capita),2018,0.73543480467685
16754,Zimbabwe,CO2 emissions (metric tons per capita),2019,0.663338328142275
16755,Zimbabwe,CO2 emissions (metric tons per capita),2020,0.530483547000938
16756,Zimbabwe,CO2 emissions (metric tons per capita),2021,None
16757,Zimbabwe,CO2 emissions (metric tons per capita),2022,None

In [31]:
co2_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16758 entries, 0 to 16757
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country or Area  16758 non-null  object
 1   Item             16758 non-null  object
 2   Year             16758 non-null  object
 3   Value            7408 non-null   object
dtypes: object(4)
memory usage: 523.8+ KB

In [32]:
co2_df.drop(["Item"], axis=1, inplace=True)
co2_df.rename(columns={'Value': 'C02_Emissions_MTPC'}, inplace=True)
co2_df

      Country or Area  Year C02_Emissions_MTPC
0               Aruba  1960               None
1               Aruba  1961               None
2               Aruba  1962               None
3               Aruba  1963               None
4               Aruba  1964               None
...               ...   ...                ...
16753        Zimbabwe  2018   0.73543480467685
16754        Zimbabwe  2019  0.663338328142275
16755        Zimbabwe  2020  0.530483547000938
16756        Zimbabwe  2021               None
16757        Zimbabwe  2022               None

[16758 rows x 3 columns]

In [33]:
co2_df.dtypes

Country or Area       object
Year                  object
C02_Emissions_MTPC    object
dtype: object

In [34]:
# Renaming columns so they aren't lost during dataframe merge
replacement_dict = {
    'Egypt, Arab Rep.': 'Egypt',
    'Congo, Dem. Rep.': 'Democratic Republic of the Congo',
    'Czechia': 'Czech Republic',
    'Iran, Islamic Rep.': 'Iran',
    "Cote d'Ivoire": 'Ivory Coast',
    'Kyrgyz Republic': 'Kyrgyzstan',
    'Lao PDR': 'Laos',
    'Russian Federation': 'Russia',
    'Slovak Republic': 'Slovakia',
    "Korea, Dem. People's Rep.": 'South Korea',
    'Syrian Arab Republic': 'Syria',
    'Turkiye': 'Turkey',
    'Viet Nam': 'Vietnam',
    'United States': 'USA',
    'Hong Kong SAR, China': 'Hong Kong SAR'
}

co2_df['Country or Area'] = co2_df['Country or Area'].replace(replacement_dict)

In [35]:
co2_df['Year'] = co2_df['Year'].astype(int)
co2_df['C02_Emissions_MTPC'] = co2_df['C02_Emissions_MTPC'].apply(lambda x: round(pd.to_numeric(x), 4) if not pd.isna(x) else None)

In [36]:
co2_df = co2_df[(co2_df['Year'] >= 1990) & (co2_df['Year'] <= 2020)]

In [37]:
co2_df[co2_df.isnull().any(axis=1)]

      Country or Area  Year  C02_Emissions_MTPC
30              Aruba  1990                 NaN
31              Aruba  1991                 NaN
32              Aruba  1992                 NaN
33              Aruba  1993                 NaN
34              Aruba  1994                 NaN
...               ...   ...                 ...
16499          Kosovo  2016                 NaN
16500          Kosovo  2017                 NaN
16501          Kosovo  2018                 NaN
16502          Kosovo  2019                 NaN
16503          Kosovo  2020                 NaN

[838 rows x 3 columns]

In [38]:
co2_df.dropna(inplace=True)

<ipython-input-38-5bb092b1e8c1>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  co2_df.dropna(inplace=True)

In [39]:
co2_output = co2_df

In [40]:
# Am going to use this table for merging with other tables due to table structure
try:
    engine = create_engine('postgresql://dap:dap@192.168.56.30:5432/climate')

    co2_output.to_sql('co2_emissions_output', engine, index=False, if_exists='replace')

    print('DataFrame uploaded to PostgreSQL successfully.')

except Exception as e:
    print('Error:', e)

DataFrame uploaded to PostgreSQL successfully.

In [41]:
co2_df= co2_df.pivot(index='Country or Area', columns='Year', values='C02_Emissions_MTPC')
co2_df= co2_df.reset_index()
co2_df.columns.name = None
co2_df

,Country or Area,1990,1991,1992,1993,1994,1995,1996,1997,1998,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,Afghanistan,0.1914,0.1807,0.1265,0.1091,0.0966,0.0888,0.0823,0.0756,0.0713,...,0.4090,0.3351,0.2981,0.2837,0.2980,0.2684,0.2812,0.2991,0.2976,0.2235
1,Africa Eastern and Southern,0.9830,0.9422,0.9079,0.9095,0.9134,0.9330,0.9432,0.9622,0.9632,...,0.9768,0.9896,1.0012,1.0138,0.9604,0.9413,0.9339,0.9215,0.9153,0.7954
2,Africa Western and Central,0.4701,0.5211,0.5580,0.5139,0.4624,0.4927,0.5543,0.5401,0.5067,...,0.4516,0.4521,0.4816,0.4935,0.4756,0.4798,0.4652,0.4758,0.4908,0.4632
3,Albania,1.8440,1.2611,0.6896,0.6440,0.6499,0.6121,0.6212,0.4698,0.5768,...,1.7681,1.5659,1.6564,1.7957,1.6652,1.5901,1.8806,1.8546,1.7495,1.5446
4,Algeria,2.4664,2.5419,2.4990,2.6401,2.6347,2.6842,2.6264,2.5252,2.4946,...,3.3052,3.6214,3.6585,3.8115,3.9520,3.8338,3.8337,3.9243,3.9944,3.7182
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
234,Vietnam,0.2889,0.2896,0.2982,0.3406,0.3680,0.4257,0.4674,0.5370,0.5896,...,1.7654,1.7416,1.8201,1.9806,2.1858,2.3842,2.4446,3.0147,3.5678,3.6764
235,World,4.0209,3.9833,3.9103,3.8750,3.8420,3.8939,3.9196,3.9353,3.9075,...,4.6895,4.6853,4.7194,4.6818,4.6008,4.5575,4.5773,4.6413,4.5820,4.2919
236,"Yemen, Rep.",0.4966,0.6116,0.6325,0.5706,0.6005,0.6540,0.6500,0.6804,0.7074,...,0.9009,0.8013,1.0312,0.9883,0.4752,0.3428,0.3224,0.3686,0.3549,0.3085
237,Zambia,0.3566,0.3650,0.3527,0.3040,0.2530,0.2452,0.1979,0.2502,0.2319,...,0.2138,0.2733,0.2782,0.2978,0.3051,0.3170,0.3937,0.4405,0.4143,0.4019
238,Zimbabwe,1.6349,1.7635,1.7356,1.5818,1.4698,1.4084,1.3296,1.2168,1.2186,...,0.8719,0.9012,0.9012,0.8668,0.8470,0.7231,0.6631,0.7354,0.6633,0.5305

In [42]:
print(co2_df[co2_df.isnull().any(axis=1)])

    Country or Area  1990    1991    1992    1993    1994    1995    1996  \
152         Namibia   NaN  0.7897  0.8334  0.9369  1.0499  1.1047  1.1658

       1997    1998  ...    2011    2012    2013    2014    2015    2016  \
152  1.1655  1.1622  ...  1.5494  1.6182  1.7067  1.7531  1.8125  1.7871

       2017    2018    2019   2020
152  1.7864  1.7788  1.7642  1.588

[1 rows x 32 columns]

In [43]:
co2_df[1990] = co2_df[1990].combine_first(co2_df[1991])

In [44]:
# Upload to postgres
try:
    engine = create_engine('postgresql://dap:dap@192.168.56.30:5432/climate')

    co2_df.to_sql('co2_emissions', engine, index=False, if_exists='replace')

    print('DataFrame uploaded to PostgreSQL successfully.')

except Exception as e:
    print('Error:', e)

DataFrame uploaded to PostgreSQL successfully.